In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('V5.csv')
df.head()

,Date,Year,Locality,Estimated Value,Sale Price,Property,Residential,num_rooms,num_bathrooms,carpet_area,property_tax_rate,Face
0,2009-01-02,2009,Waterbury,111440.0,185000.0,Single Family,Detached House,3,3,996.0,1.025953,South
1,2009-01-02,2009,Bridgeport,124670.0,150000.0,Two Family,Duplex,4,3,1241.0,1.025953,South
2,2009-01-02,2009,Waterbury,55720.0,140000.0,Single Family,Detached House,3,2,910.0,1.025953,South
3,2009-01-02,2009,Bridgeport,4775276.0,272900.0,Single Family,Detached House,3,1,971.0,1.025953,East
4,2009-01-02,2009,Bridgeport,112351.0,210000.0,?,Detached House,3,2,1092.0,1.025953,East

In [3]:
# Find number of '?' values in the dataset accross all the columns

df.isin(['?']).sum()

Date                    0
Year                    0
Locality                0
Estimated Value         0
Sale Price              0
Property             1823
Residential             0
num_rooms               0
num_bathrooms           0
carpet_area             0
property_tax_rate       0
Face                    0
dtype: int64

In [4]:
# Remove values with value '?' such that the cell becomes a null value

df = df.replace('?', np.nan)

In [5]:
df.shape

(10000, 12)

In [6]:
# Find value present in 692th row and 0th column
df.iloc[692,0]

'2009-11-16'

In [7]:
df.iloc[546, 7]

3

In [8]:
df['Locality'].unique()

array(['Waterbury', 'Bridgeport', 'Greenwich', 'Norwalk', nan,
       'Fairfield', 'West Hartford', 'Stamford'], dtype=object)

In [9]:
# Find columns which have null values
df.isnull().sum()

Date                    0
Year                    0
Locality             1253
Estimated Value      1243
Sale Price              0
Property             1823
Residential             0
num_rooms               0
num_bathrooms           0
carpet_area          1229
property_tax_rate       0
Face                    0
dtype: int64

In [13]:
df.dropna(thresh=10).shape

(9917, 12)

In [14]:
# Drop all the samples(rows) with missing values strictly greater than 2
df_cleaned = df[df.isna().sum(axis=1) <= 2]
df_cleaned.shape

(9917, 12)

In [15]:
df.isna().sum(axis=1)

0       0
1       0
2       0
3       0
4       1
       ..
9995    1
9996    1
9997    0
9998    1
9999    0
Length: 10000, dtype: int64

In [21]:
# Drop all the samples(rows) with missing values in the original data frame
df_cleaned = df.dropna(axis=0)
df_cleaned.shape

(5449, 12)

In [22]:
df_cleaned = df[df.isna().sum(axis=1) == 0]
df_cleaned.shape

(5449, 12)